tutorials/openfoam_tutorials/incompressible/les/pitzDailySmag/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.02;

deltaT          1e-05;

writeControl    timeStep;
writeInterval   250;
purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;


functions
{
    probes
    {
        type            probes;
        libs            (sampling);

        writeControl    timeStep;
        writeInterval   1;

        fields
        (
            p
        );

        probeLocations
        (
            (0.0254 0.0253 0)
            (0.0508 0.0253 0)
            (0.0762 0.0253 0)
            (0.1016 0.0253 0)
            (0.1270 0.0253 0)
            (0.1524 0.0253 0)
            (0.1778 0.0253 0)
        );
    }


    fieldAverage1
    {
        type            fieldAverage;
        libs            (fieldFunctionObjects);

        writeControl    writeTime;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }


    surfaceSampling
    {
        type            surfaces;
        libs            (sampling);

        writeControl    onEnd;

        interpolationScheme cellPoint;
        surfaceFormat       vtk;

        fields
        (
            U
            nut
        );

        surfaces
        {
            nearWall
            {
                type            patchInternalField;
                patches         (lowerWall);
                distance        1e-6;
                interpolate     true;
                triangulate     false;
            }
        }
    }

    gradU
    {
        type                grad;
        libs                (fieldFunctionObjects);

        field               U;
        result              gradU;

        executeControl      writeTime;
        writeControl        writeTime;
    }


    cellVolumes
    {
        type                writeCellVolumes;
        libs                (fieldFunctionObjects);

        executeControl      writeTime;
        writeControl        writeTime;
    }
    
}

// ************************************************************************* //